artillery.yaml
config:
  target: "http://localhost:4000"
  order: "sequence"
  phases:
    - duration: 300
      arrivalRate: 10
      maxVusers: 50
      name: Main phase
before:
  flow:
    - log: "Get auth token"
    - post:
        url: "/login"
        json:
          login: "admin"
          password: "admin"
        capture:
          - json: $.token
            as: token
scenarios:
  - flow:
      - get:
          url: "/users"
          headers:
            authorization: "Bearer {{ token }}"
      - post:
          url: "/users"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            name: "User{{ $randomString(10) }}"
            login: "User{{ $randomString(10) }}"
            password: "123456"
          capture:
            - json: $.id
              as: id
      - get:
          url: "/users/{{ id }}"
          headers:
            authorization: "Bearer {{ token }}"
      - put:
          url: "/users/{{ id }}"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            name: "User{{ $randomString(10) }}"
            login: "User{{ $randomString(10) }}"
            password: "123456"
      - delete:
          url: "/users/{{ id }}"
          headers:
            authorization: "Bearer {{ token }}"